package ch08;

public class Ex8_1_1 {
// 프로그램 오류
	// 컴파일 에러: 컴파일 할 때 발생하는 에러
	// 런타임 에러: 실행 할 때 발생하는 에러
	// 논리적 에러: 작성의도와 다르게 동작
	public static void main(String[] args) {
		//system.out.println(args[0]); // 오타나서 오류 발생
		// 컴파일러가 하는일 = 번역
		// 번역을 하려면 구문이 맞아야 함
		// 번역실패 - 컴파일러 오류

		// 프로그램 오류
		// 에러는 어쩔 수 없지만, 예외는 처리하다.
		
		// 1 에러 : 프로그램 코드에 의해서 수습될 수 없는 심각한 오류
		// 2 예외 : 프로그램 코드에 의해서 수습될 수 있는 다소 미약한 오류
		
		// 예외처리의 정의와 목적
		// 정의. 프로그램 실행시 발생할 수 있는 예외의 발생에 대비한 코드를 작성해 두는 것
		// 목적. 프로그램의 비정상 종료를 막고, 정상적인 실행상태를 유지하는 것
	}
}
